#!/usr/bin/env python3

# room.sector_type

SYMBOLS = {
    None: '[.]',
    'you': '[|=z@|n]',
    'Лес': '|g[φ]|n',
    'Вода': '|035[≈]|n',
    'Дорога': '|=o[=]|n',
    'Мост':  '|=o[|n|[003|=o=|n|=o]|n',
    'Дом': '|=y[H]|n',
    'Дом NPC': '|440[H]|n',
    'Аптека': '|030[P]|n',
    'Смотровой пост': '|=y[L]|n',
    'Приют': '|215[S]|n',
    'Магазин': '|440[S]|n',
    'Лодочная станция': '|=o[|n|[003|=oS|n|=o]|n',
    'Пирс': '|=o[|n|[003|=oP|n|=o]|n',
    'Парк': '[|gφ|n]',
    'Таверна': '|215[T]|n',
    'Гильдия': '|143[G]|n',
    'Дорога гильдии': '|143[=]|n',
    'Двор гильдии': '|143[.]|n',
    'Общежитие гильдии': '|143[H]|n',
    'Библиотека гильдии': '|143[l]|n',
    'Дом гильдии': '|143[H]|n',
    'Фонтан гильдии': '|143[f]|n',
}
